{"version":"1.0","truncation":null,"padding":null,"added_tokens":[{"id":0,"content":"[PAD]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":1,"content":"[BOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true},{"id":2,"content":"[EOS]","single_word":false,"lstrip":false,"rstrip":false,"normalized":false,"special":true}],"normalizer":null,"pre_tokenizer":{"type":"ByteLevel","add_prefix_space":false,"trim_offsets":true,"use_regex":true},"post_processor":null,"decoder":null,"model":{"type":"BPE","dropout":null,"unk_token":null,"continuing_subword_prefix":null,"end_of_word_suffix":null,"fuse_unk":false,"byte_fallback":false,"ignore_merges":false,"vocab":{"[PAD]":0,"[BOS]":1,"[EOS]":2,"(":3,")":4,"+":5,".":6,"0":7,"1":8,"2":9,"3":10,"4":11,"5":12,"6":13,"7":14,"8":15,"9":16,"=":17,"\\":18,"^":19,"a":20,"b":21,"c":22,"f":23,"g":24,"i":25,"n":26,"o":27,"p":28,"r":29,"s":30,"t":31,"x":32,"y":33,"{":34,"}":35,"ĉ":36,"Ċ":37,"č":38,"Ġ":39,"00":40,"ng":41,"png":42,"čĊ":43,"Ġ+":44,"Ġb":45,"ax":46,"Ġ=":47,"Ġax":48,"ac":49,"an":50,"co":51,"fr":52,"in":53,"sin":54,"tan":55,"}{":56,"Ġc":57,"Ġbx":58,"cos":59,"frac":60,"001":61,"002":62,"003":63,"004":64,"005":65,"006":66,"007":67,"000":68,"008":69,"0010":70,"0011":71,"0012":72,"0013":73,"0014":74,"0015":75,"0016":76,"0017":77,"0018":78,"0019":79,"0020":80,"0021":81,"0022":82,"0023":83,"0024":84,"0025":85,"0026":86,"0027":87,"0028":88,"0029":89,"0030":90,"0031":91,"0032":92,"0033":93,"0034":94,"0035":95,"0036":96,"0037":97,"0038":98,"0039":99,"0040":100,"0041":101,"0042":102,"0043":103,"0044":104,"0045":105,"0046":106,"0047":107,"0048":108,"0049":109,"0050":110,"0051":111,"0052":112,"0053":113,"0054":114,"0055":115,"0056":116,"0057":117,"0058":118,"0059":119,"0060":120,"0061":121,"0062":122,"0063":123,"0064":124,"0065":125,"0066":126,"0067":127,"0068":128,"0069":129,"0070":130,"0071":131,"0072":132,"0073":133,"0074":134,"0075":135,"0076":136,"0077":137,"0078":138,"0079":139,"0001":140,"0002":141,"0003":142,"0004":143,"0005":144,"0006":145,"0007":146,"0008":147,"0009":148,"0080":149,"0081":150,"0082":151,"0083":152,"0084":153,"0085":154,"0086":155,"0087":156,"0088":157},"merges":[["0","0"],["n","g"],["p","ng"],["č","Ċ"],["Ġ","+"],["Ġ","b"],["a","x"],["Ġ","="],["Ġ","ax"],["a","c"],["a","n"],["c","o"],["f","r"],["i","n"],["s","in"],["t","an"],["}","{"],["Ġ","c"],["Ġb","x"],["co","s"],["fr","ac"],["00","1"],["00","2"],["00","3"],["00","4"],["00","5"],["00","6"],["00","7"],["00","0"],["00","8"],["001","0"],["001","1"],["001","2"],["001","3"],["001","4"],["001","5"],["001","6"],["001","7"],["001","8"],["001","9"],["002","0"],["002","1"],["002","2"],["002","3"],["002","4"],["002","5"],["002","6"],["002","7"],["002","8"],["002","9"],["003","0"],["003","1"],["003","2"],["003","3"],["003","4"],["003","5"],["003","6"],["003","7"],["003","8"],["003","9"],["004","0"],["004","1"],["004","2"],["004","3"],["004","4"],["004","5"],["004","6"],["004","7"],["004","8"],["004","9"],["005","0"],["005","1"],["005","2"],["005","3"],["005","4"],["005","5"],["005","6"],["005","7"],["005","8"],["005","9"],["006","0"],["006","1"],["006","2"],["006","3"],["006","4"],["006","5"],["006","6"],["006","7"],["006","8"],["006","9"],["007","0"],["007","1"],["007","2"],["007","3"],["007","4"],["007","5"],["007","6"],["007","7"],["007","8"],["007","9"],["000","1"],["000","2"],["000","3"],["000","4"],["000","5"],["000","6"],["000","7"],["000","8"],["000","9"],["008","0"],["008","1"],["008","2"],["008","3"],["008","4"],["008","5"],["008","6"],["008","7"],["008","8"]]}}